{
    "numpy":{
        "title":"Numpy Library",
        "additionalNotes":true,
        "positive":[
        {
            "mainPoint":"The following points were well done",
            "subPoints":[
                "good job on using ndarrays for your Numpy-based function",
                "good job on using lists for your list-based function",
                "good job on using Numpy's built-in math functions (e.g. np.add, etc)",
                "your Numpy function is indeed faster than your function using regular Python lists"
            ]
        }
    ],
        "neutral":[
        {
            "mainPoint":"The following points would improve the Numpy solution slightly",
            "subPoints":[
                "the experimental value was passed as a float to your Numpy function, when converting to an ndarray object might have been better",
                "converting the Pandas' dataframe outside of your function(s) might have improved their performance -- remember to have a function that optimally does a single task",
                "you missed the opportunity to specify Numpy's built-in math functions (e.g. np.add), which can help with being clear and consistent. Never-the-less, that for some of the simple mathematical operations, the Numpy versus the built-in are equivalent.",
                "please follow the standard practice within the community by importing Numpy as 'np'"
            ]
        }
    ],
        "negative":[
        {
            "mainPoint":"Performance Problems",
            "subPoints":[
                "your function that uses Python lists has a time performance of:",
                "your Numpy function has a time performance of:",
                "your Numpy function should not be performing slower than your function that uses regular Python lists"

            ]
        },
        {
            "mainPoint":"The resulting data from the encoded equation was incorrect",
            "subPoints":[
                "the following mean value should have been computed:",
                "the computed results of your list function was incorrect, giving a mean value of:",
                "the computed results of your Numpy function was incorrect, giving a mean value of:"
            ]
        },
        {
            "mainPoint":"The following points need improvements",
            "subPoints":[
                "your Numpy function's performance is not maximized",
                "for your Numpy function, you did not use ndarrays. Instead you passed the following data type to the function:",
                "for your list (built-in) function, you did not use a list of floats. Instead you passed the following data type to the function:",
                "iterating over the ndarray is not needed since it is vectorized, and results in a loss of performance"
            ]
        },
        {
            "mainPoint":"Encoded Metric",
            "subPoints":[
                "your function computes the evaluation metrics and returns the sum of them. This one doesn’t make much sense. Doing so mean the resulting evaluation (i.e. the final quantitative value) is dependent upon the length of the data given. What is important is how the pairwise data (e.g. within each row) performs, which is best statistically evaluated by a mean (e.g. via a returned list/ndarray), not a sum."
            ]
        }
    ]
    }
}
