{
    "plotting":{
        "title":"Plotting",
        "additionalNotes":true,
        "positive":[
        {
            "mainPoint":"Overall plot feedback",
            "subPoints":[
                "The choices behind the plot creation were well done, resulting in clear and informative data presentation."
            ]
        },
        {
            "mainPoint":"The plot details were good regarding",
            "subPoints":[
                "subplots",
                "axis labels",
                "units",
                "line style",
                "line thickness",
                "point style",
                "point size",
                "title",
                "legend",
                "font size",
                "color"
            ]
        },
        {
            "mainPoint":"Additional Points",
            "subPoints":[
                "Good exploration of the input data (e.g., statistics, correlation analysis, running averages, etc.)",
                "Good use of a color palette",
                "Good choice of a topic - very interesting"
            ]
        }
    ],
    "neutral":[
        {
            "mainPoint":"Overall plot feedback",
            "subPoints":[
                "The choices behind the plot creation were generally good, but there is some room for improvement."
            ]
        }
    ],
        "negative":[
        {
            "mainPoint":"Overall plot feedback",
            "subPoints":[
                "The type of plot was poorly chosen. It would have been more appropriate to plot the data as:"
            ]
        },
                 {
            "mainPoint":"Too many plots were done",
            "subPoints":[
                "It would have been good to plot the data together into a single (or a few) plots, thus allowing one to more easily compare the data."
            ]
        },
        {
            "mainPoint":"Plots were too complicated",
            "subPoints":[
                "The amount of data presented in a single plot was too much. It would have been better to separate the data into more plots, allowing one to clearly observe the data.",
                "The way that the data was presented was too complicated. Making the plot simpler would enable help the viewer understand that data easier."
            ]
        },
        {
            "mainPoint":"Adding the following things would have improved the plots",
            "subPoints":[
                "axis labels",
                "units",
                "title",
                "legend"
            ]
        },
        {
            "mainPoint":"The choice in the following plot elements could have been done better",
            "subPoints":[
                "axis labels",
                "units",
                "line style",
                "line thickness",
                "point style",
                "point size",
                "font size",
                "color"
            ]
        },
        {
            "mainPoint":"Additional Issues",
            "subPoints":[
                "Some tick-mark labels were missing, leaving gaps in conveying the information",
                "related plots should have the same axis range for the values",
                "additional data exploration could have been done"
            ]
        }
        ]
    }
}
