{
    "plotting":{
        "title":"Plotting",
        "additionalNotes":true,
        "positive":[
        {
            "mainPoint":"Overall plot feedback",
            "subPoints":[
                "General - choices behind the plot(s) were well done, resulting in clear and informative data presentation",
                "Color palette - well chosen"
            ]
        },
        {
            "mainPoint":"The plot details were good regarding",
            "subPoints":[
                "axis labels",
                "color",
                "font size",
                "legend",
                "line style",
                "line thickness",
                "point style",
                "point size",
                "title",
                "units"
            ]
        }
    ],
    "neutral":[
        {
            "mainPoint":"Overall plot feedback",
            "subPoints":[
                "The choices behind the plot creation were generally good, but there is some room for improvement."
            ]
        }
    ],
        "negative":[
        {
            "mainPoint":"Overall plot feedback",
            "subPoints":[
                "Plotting data - data was not visualized/plotted.",
                "Plot type(s) - poorly chosen. It would have been more appropriate to plot the data as:",
                "Related plots/data - do not have the same axis range, preventing direct comparisons."
            ]
        },
        {
        "mainPoint":"Composition: Data Overload/Too Many Plots",
        "subPoints":[
            "Too Many Plots: Combining the data into a single (or a reduced number) plots would have been a more concise presentation and allowed easier comparison.",
            "Data Overload: The amount of data presented in a single plot was excessive (too many series/variables), leading to clutter. Consider separating the data."
            ]
        },
        {
        "mainPoint":"Missing Essential Plot Elements",
        "subPoints":[
            "Axis labels - missing or incomplete",
            "Legend - missing when multiple data series are present",
            "Units - missing on axis labels or title",
            "Title - plot title is missing"
            ]
        },
        {
        "mainPoint":"Poor Choice or Execution of Elements",
        "subPoints":[
            "Axis labels - insufficient detail, misleading, or poorly positioned.",
            "Color choice - poor contrast, non-intuitive mapping, or unsuitable for colorblind viewers.",
            "Font size - too small/large, significantly impacting readability.",
            "Line/point styles - confusingly similar or inappropriate for the data type.",
            "Line styles - a different thickness would have been more appropriate.",
            "Point styles - a different size would have been more appropriate."
            ]
        }
    ]
    }
}